GopalSaraf/Practicals/PSDL/include/proc/pic16lf18425.inc
// Register: T4CLKCON
#define T4CLKCON T4CLKCON
T4CLKCON                                 equ 0296h
// bitfield definitions
T4CLKCON_CS_POSN                         equ 0000h
T4CLKCON_CS_POSITION                     equ 0000h
T4CLKCON_CS_SIZE                         equ 0004h
T4CLKCON_CS_LENGTH                       equ 0004h
T4CLKCON_CS_MASK                         equ 000Fh
T4CLKCON_CS0_POSN                        equ 0000h
T4CLKCON_CS0_POSITION                    equ 0000h
T4CLKCON_CS0_SIZE                        equ 0001h
T4CLKCON_CS0_LENGTH                      equ 0001h
T4CLKCON_CS0_MASK                        equ 0001h
T4CLKCON_CS1_POSN                        equ 0001h
T4CLKCON_CS1_POSITION                    equ 0001h
T4CLKCON_CS1_SIZE                        equ 0001h
T4CLKCON_CS1_LENGTH                      equ 0001h
T4CLKCON_CS1_MASK                        equ 0002h
T4CLKCON_CS2_POSN                        equ 0002h
T4CLKCON_CS2_POSITION                    equ 0002h
T4CLKCON_CS2_SIZE                        equ 0001h
T4CLKCON_CS2_LENGTH                      equ 0001h
T4CLKCON_CS2_MASK                        equ 0004h
T4CLKCON_CS3_POSN                        equ 0003h
T4CLKCON_CS3_POSITION                    equ 0003h
T4CLKCON_CS3_SIZE                        equ 0001h
T4CLKCON_CS3_LENGTH                      equ 0001h
T4CLKCON_CS3_MASK                        equ 0008h
T4CLKCON_T4CS_POSN                       equ 0000h
T4CLKCON_T4CS_POSITION                   equ 0000h
T4CLKCON_T4CS_SIZE                       equ 0004h
T4CLKCON_T4CS_LENGTH                     equ 0004h
T4CLKCON_T4CS_MASK                       equ 000Fh
T4CLKCON_T4CS0_POSN                      equ 0000h
T4CLKCON_T4CS0_POSITION                  equ 0000h
T4CLKCON_T4CS0_SIZE                      equ 0001h
T4CLKCON_T4CS0_LENGTH                    equ 0001h
T4CLKCON_T4CS0_MASK                      equ 0001h
T4CLKCON_T4CS1_POSN                      equ 0001h
T4CLKCON_T4CS1_POSITION                  equ 0001h
T4CLKCON_T4CS1_SIZE                      equ 0001h
T4CLKCON_T4CS1_LENGTH                    equ 0001h
T4CLKCON_T4CS1_MASK                      equ 0002h
T4CLKCON_T4CS2_POSN                      equ 0002h
T4CLKCON_T4CS2_POSITION                  equ 0002h
T4CLKCON_T4CS2_SIZE                      equ 0001h
T4CLKCON_T4CS2_LENGTH                    equ 0001h
T4CLKCON_T4CS2_MASK                      equ 0004h
T4CLKCON_T4CS3_POSN                      equ 0003h
T4CLKCON_T4CS3_POSITION                  equ 0003h
T4CLKCON_T4CS3_SIZE                      equ 0001h
T4CLKCON_T4CS3_LENGTH                    equ 0001h
T4CLKCON_T4CS3_MASK                      equ 0008h

// Register: T4RST
#define T4RST T4RST
T4RST                                    equ 0297h
// bitfield definitions
T4RST_RSEL_POSN                          equ 0000h
T4RST_RSEL_POSITION                      equ 0000h
T4RST_RSEL_SIZE                          equ 0005h
T4RST_RSEL_LENGTH                        equ 0005h
T4RST_RSEL_MASK                          equ 001Fh
T4RST_RSEL0_POSN                         equ 0000h
T4RST_RSEL0_POSITION                     equ 0000h
T4RST_RSEL0_SIZE                         equ 0001h
T4RST_RSEL0_LENGTH                       equ 0001h
T4RST_RSEL0_MASK                         equ 0001h
T4RST_RSEL1_POSN                         equ 0001h
T4RST_RSEL1_POSITION                     equ 0001h
T4RST_RSEL1_SIZE                         equ 0001h
T4RST_RSEL1_LENGTH                       equ 0001h
T4RST_RSEL1_MASK                         equ 0002h
T4RST_RSEL2_POSN                         equ 0002h
T4RST_RSEL2_POSITION                     equ 0002h
T4RST_RSEL2_SIZE                         equ 0001h
T4RST_RSEL2_LENGTH                       equ 0001h
T4RST_RSEL2_MASK                         equ 0004h
T4RST_RSEL3_POSN                         equ 0003h
T4RST_RSEL3_POSITION                     equ 0003h
T4RST_RSEL3_SIZE                         equ 0001h
T4RST_RSEL3_LENGTH                       equ 0001h
T4RST_RSEL3_MASK                         equ 0008h
T4RST_RSEL4_POSN                         equ 0004h
T4RST_RSEL4_POSITION                     equ 0004h
T4RST_RSEL4_SIZE                         equ 0001h
T4RST_RSEL4_LENGTH                       equ 0001h
T4RST_RSEL4_MASK                         equ 0010h
T4RST_T4RSEL_POSN                        equ 0000h
T4RST_T4RSEL_POSITION                    equ 0000h
T4RST_T4RSEL_SIZE                        equ 0005h
T4RST_T4RSEL_LENGTH                      equ 0005h
T4RST_T4RSEL_MASK                        equ 001Fh
T4RST_T4RSEL0_POSN                       equ 0000h
T4RST_T4RSEL0_POSITION                   equ 0000h
T4RST_T4RSEL0_SIZE                       equ 0001h
T4RST_T4RSEL0_LENGTH                     equ 0001h
T4RST_T4RSEL0_MASK                       equ 0001h
T4RST_T4RSEL1_POSN                       equ 0001h
T4RST_T4RSEL1_POSITION                   equ 0001h
T4RST_T4RSEL1_SIZE                       equ 0001h
T4RST_T4RSEL1_LENGTH                     equ 0001h
T4RST_T4RSEL1_MASK                       equ 0002h
T4RST_T4RSEL2_POSN                       equ 0002h
T4RST_T4RSEL2_POSITION                   equ 0002h
T4RST_T4RSEL2_SIZE                       equ 0001h
T4RST_T4RSEL2_LENGTH                     equ 0001h
T4RST_T4RSEL2_MASK                       equ 0004h
T4RST_T4RSEL3_POSN                       equ 0003h
T4RST_T4RSEL3_POSITION                   equ 0003h
T4RST_T4RSEL3_SIZE                       equ 0001h
T4RST_T4RSEL3_LENGTH                     equ 0001h
T4RST_T4RSEL3_MASK                       equ 0008h
T4RST_T4RSEL4_POSN                       equ 0004h
T4RST_T4RSEL4_POSITION                   equ 0004h
T4RST_T4RSEL4_SIZE                       equ 0001h
T4RST_T4RSEL4_LENGTH                     equ 0001h
T4RST_T4RSEL4_MASK                       equ 0010h

// Register: T6TMR
#define T6TMR T6TMR
T6TMR                                    equ 0298h
// bitfield definitions
T6TMR_TMR_POSN                           equ 0000h
T6TMR_TMR_POSITION                       equ 0000h
T6TMR_TMR_SIZE                           equ 0008h
T6TMR_TMR_LENGTH                         equ 0008h
T6TMR_TMR_MASK                           equ 00FFh
T6TMR_TMR6_POSN                          equ 0000h
T6TMR_TMR6_POSITION                      equ 0000h
T6TMR_TMR6_SIZE                          equ 0008h
T6TMR_TMR6_LENGTH                        equ 0008h
T6TMR_TMR6_MASK                          equ 00FFh

// Register: T6PR
#define T6PR T6PR
T6PR                                     equ 0299h
// bitfield definitions
T6PR_PR_POSN                             equ 0000h
T6PR_PR_POSITION                         equ 0000h
T6PR_PR_SIZE                             equ 0008h
T6PR_PR_LENGTH                           equ 0008h
T6PR_PR_MASK                             equ 00FFh
T6PR_T6PR_POSN                           equ 0000h
T6PR_T6PR_POSITION                       equ 0000h
T6PR_T6PR_SIZE                           equ 0008h
T6PR_T6PR_LENGTH                         equ 0008h
T6PR_T6PR_MASK                           equ 00FFh

// Register: T6CON
#define T6CON T6CON
T6CON                                    equ 029Ah
// bitfield definitions
T6CON_OUTPS_POSN                         equ 0000h
T6CON_OUTPS_POSITION                     equ 0000h
T6CON_OUTPS_SIZE                         equ 0004h
T6CON_OUTPS_LENGTH                       equ 0004h
T6CON_OUTPS_MASK                         equ 000Fh
T6CON_CKPS_POSN                          equ 0004h
T6CON_CKPS_POSITION                      equ 0004h
T6CON_CKPS_SIZE                          equ 0003h
T6CON_CKPS_LENGTH                        equ 0003h
T6CON_CKPS_MASK                          equ 0070h
T6CON_ON_POSN                            equ 0007h
T6CON_ON_POSITION                        equ 0007h
T6CON_ON_SIZE                            equ 0001h
T6CON_ON_LENGTH                          equ 0001h
T6CON_ON_MASK                            equ 0080h
T6CON_OUTPS0_POSN                        equ 0000h
T6CON_OUTPS0_POSITION                    equ 0000h
T6CON_OUTPS0_SIZE                        equ 0001h
T6CON_OUTPS0_LENGTH                      equ 0001h
T6CON_OUTPS0_MASK                        equ 0001h
T6CON_OUTPS1_POSN                        equ 0001h
T6CON_OUTPS1_POSITION                    equ 0001h
T6CON_OUTPS1_SIZE                        equ 0001h
T6CON_OUTPS1_LENGTH                      equ 0001h
T6CON_OUTPS1_MASK                        equ 0002h
T6CON_OUTPS2_POSN                        equ 0002h
T6CON_OUTPS2_POSITION                    equ 0002h
T6CON_OUTPS2_SIZE                        equ 0001h
T6CON_OUTPS2_LENGTH                      equ 0001h
T6CON_OUTPS2_MASK                        equ 0004h
T6CON_OUTPS3_POSN                        equ 0003h
T6CON_OUTPS3_POSITION                    equ 0003h
T6CON_OUTPS3_SIZE                        equ 0001h
T6CON_OUTPS3_LENGTH                      equ 0001h
T6CON_OUTPS3_MASK                        equ 0008h
T6CON_CKPS0_POSN                         equ 0004h
T6CON_CKPS0_POSITION                     equ 0004h
T6CON_CKPS0_SIZE                         equ 0001h
T6CON_CKPS0_LENGTH                       equ 0001h
T6CON_CKPS0_MASK                         equ 0010h
T6CON_CKPS1_POSN                         equ 0005h
T6CON_CKPS1_POSITION                     equ 0005h
T6CON_CKPS1_SIZE                         equ 0001h
T6CON_CKPS1_LENGTH                       equ 0001h
T6CON_CKPS1_MASK                         equ 0020h
T6CON_CKPS2_POSN                         equ 0006h
T6CON_CKPS2_POSITION                     equ 0006h
T6CON_CKPS2_SIZE                         equ 0001h
T6CON_CKPS2_LENGTH                       equ 0001h
T6CON_CKPS2_MASK                         equ 0040h
T6CON_T6OUTPS_POSN                       equ 0000h
T6CON_T6OUTPS_POSITION                   equ 0000h
T6CON_T6OUTPS_SIZE                       equ 0004h
T6CON_T6OUTPS_LENGTH                     equ 0004h
T6CON_T6OUTPS_MASK                       equ 000Fh
T6CON_T6CKPS_POSN                        equ 0004h
T6CON_T6CKPS_POSITION                    equ 0004h
T6CON_T6CKPS_SIZE                        equ 0003h
T6CON_T6CKPS_LENGTH                      equ 0003h
T6CON_T6CKPS_MASK                        equ 0070h
T6CON_T6ON_POSN                          equ 0007h
T6CON_T6ON_POSITION                      equ 0007h
T6CON_T6ON_SIZE                          equ 0001h
T6CON_T6ON_LENGTH                        equ 0001h
T6CON_T6ON_MASK                          equ 0080h
T6CON_T6OUTPS0_POSN                      equ 0000h
T6CON_T6OUTPS0_POSITION                  equ 0000h
T6CON_T6OUTPS0_SIZE                      equ 0001h
T6CON_T6OUTPS0_LENGTH                    equ 0001h
T6CON_T6OUTPS0_MASK                      equ 0001h
T6CON_T6OUTPS1_POSN                      equ 0001h
T6CON_T6OUTPS1_POSITION                  equ 0001h
T6CON_T6OUTPS1_SIZE                      equ 0001h
T6CON_T6OUTPS1_LENGTH                    equ 0001h
T6CON_T6OUTPS1_MASK                      equ 0002h
T6CON_T6OUTPS2_POSN                      equ 0002h
T6CON_T6OUTPS2_POSITION                  equ 0002h
T6CON_T6OUTPS2_SIZE                      equ 0001h
T6CON_T6OUTPS2_LENGTH                    equ 0001h
T6CON_T6OUTPS2_MASK                      equ 0004h
T6CON_T6OUTPS3_POSN                      equ 0003h
T6CON_T6OUTPS3_POSITION                  equ 0003h
T6CON_T6OUTPS3_SIZE                      equ 0001h
T6CON_T6OUTPS3_LENGTH                    equ 0001h
T6CON_T6OUTPS3_MASK                      equ 0008h
T6CON_T6CKPS0_POSN                       equ 0004h
T6CON_T6CKPS0_POSITION                   equ 0004h
T6CON_T6CKPS0_SIZE                       equ 0001h
T6CON_T6CKPS0_LENGTH                     equ 0001h
T6CON_T6CKPS0_MASK                       equ 0010h
T6CON_T6CKPS1_POSN                       equ 0005h
T6CON_T6CKPS1_POSITION                   equ 0005h
T6CON_T6CKPS1_SIZE                       equ 0001h
T6CON_T6CKPS1_LENGTH                     equ 0001h
T6CON_T6CKPS1_MASK                       equ 0020h
T6CON_T6CKPS2_POSN                       equ 0006h
T6CON_T6CKPS2_POSITION                   equ 0006h
T6CON_T6CKPS2_SIZE                       equ 0001h
T6CON_T6CKPS2_LENGTH                     equ 0001h
T6CON_T6CKPS2_MASK                       equ 0040h
T6CON_TMR6ON_POSN                        equ 0007h
T6CON_TMR6ON_POSITION                    equ 0007h
T6CON_TMR6ON_SIZE                        equ 0001h
T6CON_TMR6ON_LENGTH                      equ 0001h
T6CON_TMR6ON_MASK                        equ 0080h

// Register: T6HLT
#define T6HLT T6HLT
T6HLT                                    equ 029Bh
// bitfield definitions
T6HLT_MODE_POSN                          equ 0000h
T6HLT_MODE_POSITION                      equ 0000h
T6HLT_MODE_SIZE                          equ 0005h
T6HLT_MODE_LENGTH                        equ 0005h
T6HLT_MODE_MASK                          equ 001Fh
T6HLT_CKSYNC_POSN                        equ 0005h
T6HLT_CKSYNC_POSITION                    equ 0005h
T6HLT_CKSYNC_SIZE                        equ 0001h
T6HLT_CKSYNC_LENGTH                      equ 0001h
T6HLT_CKSYNC_MASK                        equ 0020h
T6HLT_CKPOL_POSN                         equ 0006h
T6HLT_CKPOL_POSITION                     equ 0006h
T6HLT_CKPOL_SIZE                         equ 0001h
T6HLT_CKPOL_LENGTH                       equ 0001h
T6HLT_CKPOL_MASK                         equ 0040h
T6HLT_PSYNC_POSN                         equ 0007h
T6HLT_PSYNC_POSITION                     equ 0007h
T6HLT_PSYNC_SIZE                         equ 0001h
T6HLT_PSYNC_LENGTH                       equ 0001h
T6HLT_PSYNC_MASK                         equ 0080h
T6HLT_MODE0_POSN                         equ 0000h
T6HLT_MODE0_POSITION                     equ 0000h
T6HLT_MODE0_SIZE                         equ 0001h
T6HLT_MODE0_LENGTH                       equ 0001h
T6HLT_MODE0_MASK                         equ 0001h
T6HLT_MODE1_POSN                         equ 0001h
T6HLT_MODE1_POSITION                     equ 0001h
T6HLT_MODE1_SIZE                         equ 0001h
T6HLT_MODE1_LENGTH                       equ 0001h
T6HLT_MODE1_MASK                         equ 0002h
T6HLT_MODE2_POSN                         equ 0002h
T6HLT_MODE2_POSITION                     equ 0002h
T6HLT_MODE2_SIZE                         equ 0001h
T6HLT_MODE2_LENGTH                       equ 0001h
T6HLT_MODE2_MASK                         equ 0004h
T6HLT_MODE3_POSN                         equ 0003h
T6HLT_MODE3_POSITION                     equ 0003h
T6HLT_MODE3_SIZE                         equ 0001h
T6HLT_MODE3_LENGTH                       equ 0001h
T6HLT_MODE3_MASK                         equ 0008h
T6HLT_MODE4_POSN                         equ 0004h
T6HLT_MODE4_POSITION                     equ 0004h
T6HLT_MODE4_SIZE                         equ 0001h
T6HLT_MODE4_LENGTH                       equ 0001h
T6HLT_MODE4_MASK                         equ 0010h
T6HLT_T6MODE_POSN                        equ 0000h
T6HLT_T6MODE_POSITION                    equ 0000h
T6HLT_T6MODE_SIZE                        equ 0005h
T6HLT_T6MODE_LENGTH                      equ 0005h
T6HLT_T6MODE_MASK                        equ 001Fh
T6HLT_T6CKSYNC_POSN                      equ 0005h
T6HLT_T6CKSYNC_POSITION                  equ 0005h
T6HLT_T6CKSYNC_SIZE                      equ 0001h
T6HLT_T6CKSYNC_LENGTH                    equ 0001h
T6HLT_T6CKSYNC_MASK                      equ 0020h
T6HLT_T6CKPOL_POSN                       equ 0006h
T6HLT_T6CKPOL_POSITION                   equ 0006h
T6HLT_T6CKPOL_SIZE                       equ 0001h
T6HLT_T6CKPOL_LENGTH                     equ 0001h
T6HLT_T6CKPOL_MASK                       equ 0040h
T6HLT_T6PSYNC_POSN                       equ 0007h
T6HLT_T6PSYNC_POSITION                   equ 0007h
T6HLT_T6PSYNC_SIZE                       equ 0001h
T6HLT_T6PSYNC_LENGTH                     equ 0001h
T6HLT_T6PSYNC_MASK                       equ 0080h
T6HLT_T6MODE0_POSN                       equ 0000h
T6HLT_T6MODE0_POSITION                   equ 0000h
T6HLT_T6MODE0_SIZE                       equ 0001h
T6HLT_T6MODE0_LENGTH                     equ 0001h
T6HLT_T6MODE0_MASK                       equ 0001h
T6HLT_T6MODE1_POSN                       equ 0001h
T6HLT_T6MODE1_POSITION                   equ 0001h
T6HLT_T6MODE1_SIZE                       equ 0001h
T6HLT_T6MODE1_LENGTH                     equ 0001h
T6HLT_T6MODE1_MASK                       equ 0002h
T6HLT_T6MODE2_POSN                       equ 0002h
T6HLT_T6MODE2_POSITION                   equ 0002h
T6HLT_T6MODE2_SIZE                       equ 0001h
T6HLT_T6MODE2_LENGTH                     equ 0001h
T6HLT_T6MODE2_MASK                       equ 0004h
T6HLT_T6MODE3_POSN                       equ 0003h
T6HLT_T6MODE3_POSITION                   equ 0003h
T6HLT_T6MODE3_SIZE                       equ 0001h
T6HLT_T6MODE3_LENGTH                     equ 0001h
T6HLT_T6MODE3_MASK                       equ 0008h
T6HLT_T6MODE4_POSN                       equ 0004h
T6HLT_T6MODE4_POSITION                   equ 0004h
T6HLT_T6MODE4_SIZE                       equ 0001h
T6HLT_T6MODE4_LENGTH                     equ 0001h
T6HLT_T6MODE4_MASK                       equ 0010h

// Register: T6CLKCON
#define T6CLKCON T6CLKCON
T6CLKCON                                 equ 029Ch
// bitfield definitions
T6CLKCON_CS_POSN                         equ 0000h
T6CLKCON_CS_POSITION                     equ 0000h
T6CLKCON_CS_SIZE                         equ 0004h
T6CLKCON_CS_LENGTH                       equ 0004h
T6CLKCON_CS_MASK                         equ 000Fh
T6CLKCON_CS0_POSN                        equ 0000h
T6CLKCON_CS0_POSITION                    equ 0000h
T6CLKCON_CS0_SIZE                        equ 0001h
T6CLKCON_CS0_LENGTH                      equ 0001h
T6CLKCON_CS0_MASK                        equ 0001h
T6CLKCON_CS1_POSN                        equ 0001h
T6CLKCON_CS1_POSITION                    equ 0001h
T6CLKCON_CS1_SIZE                        equ 0001h
T6CLKCON_CS1_LENGTH                      equ 0001h
T6CLKCON_CS1_MASK                        equ 0002h
T6CLKCON_CS2_POSN                        equ 0002h
T6CLKCON_CS2_POSITION                    equ 0002h
T6CLKCON_CS2_SIZE                        equ 0001h
T6CLKCON_CS2_LENGTH                      equ 0001h
T6CLKCON_CS2_MASK                        equ 0004h
T6CLKCON_CS3_POSN                        equ 0003h
T6CLKCON_CS3_POSITION                    equ 0003h
T6CLKCON_CS3_SIZE                        equ 0001h
T6CLKCON_CS3_LENGTH                      equ 0001h
T6CLKCON_CS3_MASK                        equ 0008h
T6CLKCON_T6CS_POSN                       equ 0000h
T6CLKCON_T6CS_POSITION                   equ 0000h
T6CLKCON_T6CS_SIZE                       equ 0004h
T6CLKCON_T6CS_LENGTH                     equ 0004h
T6CLKCON_T6CS_MASK                       equ 000Fh
T6CLKCON_T6CS0_POSN                      equ 0000h
T6CLKCON_T6CS0_POSITION                  equ 0000h
T6CLKCON_T6CS0_SIZE                      equ 0001h
T6CLKCON_T6CS0_LENGTH                    equ 0001h
T6CLKCON_T6CS0_MASK                      equ 0001h
T6CLKCON_T6CS1_POSN                      equ 0001h
T6CLKCON_T6CS1_POSITION                  equ 0001h
T6CLKCON_T6CS1_SIZE                      equ 0001h
T6CLKCON_T6CS1_LENGTH                    equ 0001h
T6CLKCON_T6CS1_MASK                      equ 0002h
T6CLKCON_T6CS2_POSN                      equ 0002h
T6CLKCON_T6CS2_POSITION                  equ 0002h
T6CLKCON_T6CS2_SIZE                      equ 0001h
T6CLKCON_T6CS2_LENGTH                    equ 0001h
T6CLKCON_T6CS2_MASK                      equ 0004h
T6CLKCON_T6CS3_POSN                      equ 0003h
T6CLKCON_T6CS3_POSITION                  equ 0003h
T6CLKCON_T6CS3_SIZE                      equ 0001h
T6CLKCON_T6CS3_LENGTH                    equ 0001h
T6CLKCON_T6CS3_MASK                      equ 0008h

// Register: T6RST
#define T6RST T6RST
T6RST                                    equ 029Dh
// bitfield definitions
T6RST_RSEL_POSN                          equ 0000h
T6RST_RSEL_POSITION                      equ 0000h
T6RST_RSEL_SIZE                          equ 0005h
T6RST_RSEL_LENGTH                        equ 0005h
T6RST_RSEL_MASK                          equ 001Fh
T6RST_RSEL0_POSN                         equ 0000h
T6RST_RSEL0_POSITION                     equ 0000h
T6RST_RSEL0_SIZE                         equ 0001h
T6RST_RSEL0_LENGTH                       equ 0001h
T6RST_RSEL0_MASK                         equ 0001h
T6RST_RSEL1_POSN                         equ 0001h
T6RST_RSEL1_POSITION                     equ 0001h
T6RST_RSEL1_SIZE                         equ 0001h
T6RST_RSEL1_LENGTH                       equ 0001h
T6RST_RSEL1_MASK                         equ 0002h
T6RST_RSEL2_POSN                         equ 0002h
T6RST_RSEL2_POSITION                     equ 0002h
T6RST_RSEL2_SIZE                         equ 0001h
T6RST_RSEL2_LENGTH                       equ 0001h
T6RST_RSEL2_MASK                         equ 0004h
T6RST_RSEL3_POSN                         equ 0003h
T6RST_RSEL3_POSITION                     equ 0003h
T6RST_RSEL3_SIZE                         equ 0001h
T6RST_RSEL3_LENGTH                       equ 0001h
T6RST_RSEL3_MASK                         equ 0008h
T6RST_RSEL4_POSN                         equ 0004h
T6RST_RSEL4_POSITION                     equ 0004h
T6RST_RSEL4_SIZE                         equ 0001h
T6RST_RSEL4_LENGTH                       equ 0001h
T6RST_RSEL4_MASK                         equ 0010h
T6RST_T6RSEL_POSN                        equ 0000h
T6RST_T6RSEL_POSITION                    equ 0000h
T6RST_T6RSEL_SIZE                        equ 0005h
T6RST_T6RSEL_LENGTH                      equ 0005h
T6RST_T6RSEL_MASK                        equ 001Fh
T6RST_T6RSEL0_POSN                       equ 0000h
T6RST_T6RSEL0_POSITION                   equ 0000h
T6RST_T6RSEL0_SIZE                       equ 0001h
T6RST_T6RSEL0_LENGTH                     equ 0001h
T6RST_T6RSEL0_MASK                       equ 0001h
T6RST_T6RSEL1_POSN                       equ 0001h
T6RST_T6RSEL1_POSITION                   equ 0001h
T6RST_T6RSEL1_SIZE                       equ 0001h
T6RST_T6RSEL1_LENGTH                     equ 0001h
T6RST_T6RSEL1_MASK                       equ 0002h
T6RST_T6RSEL2_POSN                       equ 0002h
T6RST_T6RSEL2_POSITION                   equ 0002h
T6RST_T6RSEL2_SIZE                       equ 0001h
T6RST_T6RSEL2_LENGTH                     equ 0001h
T6RST_T6RSEL2_MASK                       equ 0004h
T6RST_T6RSEL3_POSN                       equ 0003h
T6RST_T6RSEL3_POSITION                   equ 0003h
T6RST_T6RSEL3_SIZE                       equ 0001h
T6RST_T6RSEL3_LENGTH                     equ 0001h
T6RST_T6RSEL3_MASK                       equ 0008h
T6RST_T6RSEL4_POSN                       equ 0004h
T6RST_T6RSEL4_POSITION                   equ 0004h
T6RST_T6RSEL4_SIZE                       equ 0001h
T6RST_T6RSEL4_LENGTH                     equ 0001h
T6RST_T6RSEL4_MASK                       equ 0010h

// Register: ADCPCON0
#define ADCPCON0 ADCPCON0
ADCPCON0                                 equ 029Fh
// bitfield definitions
ADCPCON0_CPRDY_POSN                      equ 0000h
ADCPCON0_CPRDY_POSITION                  equ 0000h
ADCPCON0_CPRDY_SIZE                      equ 0001h
ADCPCON0_CPRDY_LENGTH                    equ 0001h
ADCPCON0_CPRDY_MASK                      equ 0001h
ADCPCON0_CPON_POSN                       equ 0007h
ADCPCON0_CPON_POSITION                   equ 0007h
ADCPCON0_CPON_SIZE                       equ 0001h
ADCPCON0_CPON_LENGTH                     equ 0001h
ADCPCON0_CPON_MASK                       equ 0080h

