GopalSaraf/Practicals/PSDL/include/proc/pic16lf18425.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 0892h
// bitfield definitions
OSCTUNE_HFTUN_POSN                       equ 0000h
OSCTUNE_HFTUN_POSITION                   equ 0000h
OSCTUNE_HFTUN_SIZE                       equ 0006h
OSCTUNE_HFTUN_LENGTH                     equ 0006h
OSCTUNE_HFTUN_MASK                       equ 003Fh
OSCTUNE_HFTUN0_POSN                      equ 0000h
OSCTUNE_HFTUN0_POSITION                  equ 0000h
OSCTUNE_HFTUN0_SIZE                      equ 0001h
OSCTUNE_HFTUN0_LENGTH                    equ 0001h
OSCTUNE_HFTUN0_MASK                      equ 0001h
OSCTUNE_HFTUN1_POSN                      equ 0001h
OSCTUNE_HFTUN1_POSITION                  equ 0001h
OSCTUNE_HFTUN1_SIZE                      equ 0001h
OSCTUNE_HFTUN1_LENGTH                    equ 0001h
OSCTUNE_HFTUN1_MASK                      equ 0002h
OSCTUNE_HFTUN2_POSN                      equ 0002h
OSCTUNE_HFTUN2_POSITION                  equ 0002h
OSCTUNE_HFTUN2_SIZE                      equ 0001h
OSCTUNE_HFTUN2_LENGTH                    equ 0001h
OSCTUNE_HFTUN2_MASK                      equ 0004h
OSCTUNE_HFTUN3_POSN                      equ 0003h
OSCTUNE_HFTUN3_POSITION                  equ 0003h
OSCTUNE_HFTUN3_SIZE                      equ 0001h
OSCTUNE_HFTUN3_LENGTH                    equ 0001h
OSCTUNE_HFTUN3_MASK                      equ 0008h
OSCTUNE_HFTUN4_POSN                      equ 0004h
OSCTUNE_HFTUN4_POSITION                  equ 0004h
OSCTUNE_HFTUN4_SIZE                      equ 0001h
OSCTUNE_HFTUN4_LENGTH                    equ 0001h
OSCTUNE_HFTUN4_MASK                      equ 0010h
OSCTUNE_HFTUN5_POSN                      equ 0005h
OSCTUNE_HFTUN5_POSITION                  equ 0005h
OSCTUNE_HFTUN5_SIZE                      equ 0001h
OSCTUNE_HFTUN5_LENGTH                    equ 0001h
OSCTUNE_HFTUN5_MASK                      equ 0020h

// Register: OSCFRQ
#define OSCFRQ OSCFRQ
OSCFRQ                                   equ 0893h
// bitfield definitions
OSCFRQ_HFFRQ_POSN                        equ 0000h
OSCFRQ_HFFRQ_POSITION                    equ 0000h
OSCFRQ_HFFRQ_SIZE                        equ 0003h
OSCFRQ_HFFRQ_LENGTH                      equ 0003h
OSCFRQ_HFFRQ_MASK                        equ 0007h
OSCFRQ_HFFRQ0_POSN                       equ 0000h
OSCFRQ_HFFRQ0_POSITION                   equ 0000h
OSCFRQ_HFFRQ0_SIZE                       equ 0001h
OSCFRQ_HFFRQ0_LENGTH                     equ 0001h
OSCFRQ_HFFRQ0_MASK                       equ 0001h
OSCFRQ_HFFRQ1_POSN                       equ 0001h
OSCFRQ_HFFRQ1_POSITION                   equ 0001h
OSCFRQ_HFFRQ1_SIZE                       equ 0001h
OSCFRQ_HFFRQ1_LENGTH                     equ 0001h
OSCFRQ_HFFRQ1_MASK                       equ 0002h
OSCFRQ_HFFRQ2_POSN                       equ 0002h
OSCFRQ_HFFRQ2_POSITION                   equ 0002h
OSCFRQ_HFFRQ2_SIZE                       equ 0001h
OSCFRQ_HFFRQ2_LENGTH                     equ 0001h
OSCFRQ_HFFRQ2_MASK                       equ 0004h

// Register: CLKRCON
#define CLKRCON CLKRCON
CLKRCON                                  equ 0895h
// bitfield definitions
CLKRCON_CLKRDIV_POSN                     equ 0000h
CLKRCON_CLKRDIV_POSITION                 equ 0000h
CLKRCON_CLKRDIV_SIZE                     equ 0003h
CLKRCON_CLKRDIV_LENGTH                   equ 0003h
CLKRCON_CLKRDIV_MASK                     equ 0007h
CLKRCON_CLKRDC_POSN                      equ 0003h
CLKRCON_CLKRDC_POSITION                  equ 0003h
CLKRCON_CLKRDC_SIZE                      equ 0002h
CLKRCON_CLKRDC_LENGTH                    equ 0002h
CLKRCON_CLKRDC_MASK                      equ 0018h
CLKRCON_CLKREN_POSN                      equ 0007h
CLKRCON_CLKREN_POSITION                  equ 0007h
CLKRCON_CLKREN_SIZE                      equ 0001h
CLKRCON_CLKREN_LENGTH                    equ 0001h
CLKRCON_CLKREN_MASK                      equ 0080h
CLKRCON_CLKRDIV0_POSN                    equ 0000h
CLKRCON_CLKRDIV0_POSITION                equ 0000h
CLKRCON_CLKRDIV0_SIZE                    equ 0001h
CLKRCON_CLKRDIV0_LENGTH                  equ 0001h
CLKRCON_CLKRDIV0_MASK                    equ 0001h
CLKRCON_CLKRDIV1_POSN                    equ 0001h
CLKRCON_CLKRDIV1_POSITION                equ 0001h
CLKRCON_CLKRDIV1_SIZE                    equ 0001h
CLKRCON_CLKRDIV1_LENGTH                  equ 0001h
CLKRCON_CLKRDIV1_MASK                    equ 0002h
CLKRCON_CLKRDIV2_POSN                    equ 0002h
CLKRCON_CLKRDIV2_POSITION                equ 0002h
CLKRCON_CLKRDIV2_SIZE                    equ 0001h
CLKRCON_CLKRDIV2_LENGTH                  equ 0001h
CLKRCON_CLKRDIV2_MASK                    equ 0004h
CLKRCON_CLKRDC0_POSN                     equ 0003h
CLKRCON_CLKRDC0_POSITION                 equ 0003h
CLKRCON_CLKRDC0_SIZE                     equ 0001h
CLKRCON_CLKRDC0_LENGTH                   equ 0001h
CLKRCON_CLKRDC0_MASK                     equ 0008h
CLKRCON_CLKRDC1_POSN                     equ 0004h
CLKRCON_CLKRDC1_POSITION                 equ 0004h
CLKRCON_CLKRDC1_SIZE                     equ 0001h
CLKRCON_CLKRDC1_LENGTH                   equ 0001h
CLKRCON_CLKRDC1_MASK                     equ 0010h

// Register: CLKRCLK
#define CLKRCLK CLKRCLK
CLKRCLK                                  equ 0896h
// bitfield definitions
CLKRCLK_CLKRCLK_POSN                     equ 0000h
CLKRCLK_CLKRCLK_POSITION                 equ 0000h
CLKRCLK_CLKRCLK_SIZE                     equ 0004h
CLKRCLK_CLKRCLK_LENGTH                   equ 0004h
CLKRCLK_CLKRCLK_MASK                     equ 000Fh
CLKRCLK_CLKRCLK0_POSN                    equ 0000h
CLKRCLK_CLKRCLK0_POSITION                equ 0000h
CLKRCLK_CLKRCLK0_SIZE                    equ 0001h
CLKRCLK_CLKRCLK0_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK0_MASK                    equ 0001h
CLKRCLK_CLKRCLK1_POSN                    equ 0001h
CLKRCLK_CLKRCLK1_POSITION                equ 0001h
CLKRCLK_CLKRCLK1_SIZE                    equ 0001h
CLKRCLK_CLKRCLK1_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK1_MASK                    equ 0002h
CLKRCLK_CLKRCLK2_POSN                    equ 0002h
CLKRCLK_CLKRCLK2_POSITION                equ 0002h
CLKRCLK_CLKRCLK2_SIZE                    equ 0001h
CLKRCLK_CLKRCLK2_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK2_MASK                    equ 0004h
CLKRCLK_CLKRCLK3_POSN                    equ 0003h
CLKRCLK_CLKRCLK3_POSITION                equ 0003h
CLKRCLK_CLKRCLK3_SIZE                    equ 0001h
CLKRCLK_CLKRCLK3_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK3_MASK                    equ 0008h

// Register: MD1CON0
#define MD1CON0 MD1CON0
MD1CON0                                  equ 0897h
// bitfield definitions
MD1CON0_BIT_POSN                         equ 0000h
MD1CON0_BIT_POSITION                     equ 0000h
MD1CON0_BIT_SIZE                         equ 0001h
MD1CON0_BIT_LENGTH                       equ 0001h
MD1CON0_BIT_MASK                         equ 0001h
MD1CON0_OPOL_POSN                        equ 0004h
MD1CON0_OPOL_POSITION                    equ 0004h
MD1CON0_OPOL_SIZE                        equ 0001h
MD1CON0_OPOL_LENGTH                      equ 0001h
MD1CON0_OPOL_MASK                        equ 0010h
MD1CON0_OUT_POSN                         equ 0005h
MD1CON0_OUT_POSITION                     equ 0005h
MD1CON0_OUT_SIZE                         equ 0001h
MD1CON0_OUT_LENGTH                       equ 0001h
MD1CON0_OUT_MASK                         equ 0020h
MD1CON0_EN_POSN                          equ 0007h
MD1CON0_EN_POSITION                      equ 0007h
MD1CON0_EN_SIZE                          equ 0001h
MD1CON0_EN_LENGTH                        equ 0001h
MD1CON0_EN_MASK                          equ 0080h
MD1CON0_MD1BIT_POSN                      equ 0000h
MD1CON0_MD1BIT_POSITION                  equ 0000h
MD1CON0_MD1BIT_SIZE                      equ 0001h
MD1CON0_MD1BIT_LENGTH                    equ 0001h
MD1CON0_MD1BIT_MASK                      equ 0001h
MD1CON0_MD1OPOL_POSN                     equ 0004h
MD1CON0_MD1OPOL_POSITION                 equ 0004h
MD1CON0_MD1OPOL_SIZE                     equ 0001h
MD1CON0_MD1OPOL_LENGTH                   equ 0001h
MD1CON0_MD1OPOL_MASK                     equ 0010h
MD1CON0_MD1OUT_POSN                      equ 0005h
MD1CON0_MD1OUT_POSITION                  equ 0005h
MD1CON0_MD1OUT_SIZE                      equ 0001h
MD1CON0_MD1OUT_LENGTH                    equ 0001h
MD1CON0_MD1OUT_MASK                      equ 0020h
MD1CON0_MD1EN_POSN                       equ 0007h
MD1CON0_MD1EN_POSITION                   equ 0007h
MD1CON0_MD1EN_SIZE                       equ 0001h
MD1CON0_MD1EN_LENGTH                     equ 0001h
MD1CON0_MD1EN_MASK                       equ 0080h

