GopalSaraf/Practicals/PSDL/include/proc/pic16lf18425.inc
// Register: CLC4SEL2
#define CLC4SEL2 CLC4SEL2
CLC4SEL2                                 equ 01E32h
// bitfield definitions
CLC4SEL2_LC4D3S0_POSN                    equ 0000h
CLC4SEL2_LC4D3S0_POSITION                equ 0000h
CLC4SEL2_LC4D3S0_SIZE                    equ 0001h
CLC4SEL2_LC4D3S0_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S0_MASK                    equ 0001h
CLC4SEL2_LC4D3S1_POSN                    equ 0001h
CLC4SEL2_LC4D3S1_POSITION                equ 0001h
CLC4SEL2_LC4D3S1_SIZE                    equ 0001h
CLC4SEL2_LC4D3S1_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S1_MASK                    equ 0002h
CLC4SEL2_LC4D3S2_POSN                    equ 0002h
CLC4SEL2_LC4D3S2_POSITION                equ 0002h
CLC4SEL2_LC4D3S2_SIZE                    equ 0001h
CLC4SEL2_LC4D3S2_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S2_MASK                    equ 0004h
CLC4SEL2_LC4D3S3_POSN                    equ 0003h
CLC4SEL2_LC4D3S3_POSITION                equ 0003h
CLC4SEL2_LC4D3S3_SIZE                    equ 0001h
CLC4SEL2_LC4D3S3_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S3_MASK                    equ 0008h
CLC4SEL2_LC4D3S4_POSN                    equ 0004h
CLC4SEL2_LC4D3S4_POSITION                equ 0004h
CLC4SEL2_LC4D3S4_SIZE                    equ 0001h
CLC4SEL2_LC4D3S4_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S4_MASK                    equ 0010h
CLC4SEL2_LC4D3S5_POSN                    equ 0005h
CLC4SEL2_LC4D3S5_POSITION                equ 0005h
CLC4SEL2_LC4D3S5_SIZE                    equ 0001h
CLC4SEL2_LC4D3S5_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S5_MASK                    equ 0020h
CLC4SEL2_LC4D3S_POSN                     equ 0000h
CLC4SEL2_LC4D3S_POSITION                 equ 0000h
CLC4SEL2_LC4D3S_SIZE                     equ 0008h
CLC4SEL2_LC4D3S_LENGTH                   equ 0008h
CLC4SEL2_LC4D3S_MASK                     equ 00FFh
CLC4SEL2_D3S_POSN                        equ 0000h
CLC4SEL2_D3S_POSITION                    equ 0000h
CLC4SEL2_D3S_SIZE                        equ 0008h
CLC4SEL2_D3S_LENGTH                      equ 0008h
CLC4SEL2_D3S_MASK                        equ 00FFh
CLC4SEL2_D3S0_POSN                       equ 0000h
CLC4SEL2_D3S0_POSITION                   equ 0000h
CLC4SEL2_D3S0_SIZE                       equ 0001h
CLC4SEL2_D3S0_LENGTH                     equ 0001h
CLC4SEL2_D3S0_MASK                       equ 0001h
CLC4SEL2_D3S1_POSN                       equ 0001h
CLC4SEL2_D3S1_POSITION                   equ 0001h
CLC4SEL2_D3S1_SIZE                       equ 0001h
CLC4SEL2_D3S1_LENGTH                     equ 0001h
CLC4SEL2_D3S1_MASK                       equ 0002h
CLC4SEL2_D3S2_POSN                       equ 0002h
CLC4SEL2_D3S2_POSITION                   equ 0002h
CLC4SEL2_D3S2_SIZE                       equ 0001h
CLC4SEL2_D3S2_LENGTH                     equ 0001h
CLC4SEL2_D3S2_MASK                       equ 0004h
CLC4SEL2_D3S3_POSN                       equ 0003h
CLC4SEL2_D3S3_POSITION                   equ 0003h
CLC4SEL2_D3S3_SIZE                       equ 0001h
CLC4SEL2_D3S3_LENGTH                     equ 0001h
CLC4SEL2_D3S3_MASK                       equ 0008h
CLC4SEL2_D3S4_POSN                       equ 0004h
CLC4SEL2_D3S4_POSITION                   equ 0004h
CLC4SEL2_D3S4_SIZE                       equ 0001h
CLC4SEL2_D3S4_LENGTH                     equ 0001h
CLC4SEL2_D3S4_MASK                       equ 0010h
CLC4SEL2_D3S5_POSN                       equ 0005h
CLC4SEL2_D3S5_POSITION                   equ 0005h
CLC4SEL2_D3S5_SIZE                       equ 0001h
CLC4SEL2_D3S5_LENGTH                     equ 0001h
CLC4SEL2_D3S5_MASK                       equ 0020h

// Register: CLC4SEL3
#define CLC4SEL3 CLC4SEL3
CLC4SEL3                                 equ 01E33h
// bitfield definitions
CLC4SEL3_LC4D4S0_POSN                    equ 0000h
CLC4SEL3_LC4D4S0_POSITION                equ 0000h
CLC4SEL3_LC4D4S0_SIZE                    equ 0001h
CLC4SEL3_LC4D4S0_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S0_MASK                    equ 0001h
CLC4SEL3_LC4D4S1_POSN                    equ 0001h
CLC4SEL3_LC4D4S1_POSITION                equ 0001h
CLC4SEL3_LC4D4S1_SIZE                    equ 0001h
CLC4SEL3_LC4D4S1_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S1_MASK                    equ 0002h
CLC4SEL3_LC4D4S2_POSN                    equ 0002h
CLC4SEL3_LC4D4S2_POSITION                equ 0002h
CLC4SEL3_LC4D4S2_SIZE                    equ 0001h
CLC4SEL3_LC4D4S2_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S2_MASK                    equ 0004h
CLC4SEL3_LC4D4S3_POSN                    equ 0003h
CLC4SEL3_LC4D4S3_POSITION                equ 0003h
CLC4SEL3_LC4D4S3_SIZE                    equ 0001h
CLC4SEL3_LC4D4S3_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S3_MASK                    equ 0008h
CLC4SEL3_LC4D4S4_POSN                    equ 0004h
CLC4SEL3_LC4D4S4_POSITION                equ 0004h
CLC4SEL3_LC4D4S4_SIZE                    equ 0001h
CLC4SEL3_LC4D4S4_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S4_MASK                    equ 0010h
CLC4SEL3_LC4D4S5_POSN                    equ 0005h
CLC4SEL3_LC4D4S5_POSITION                equ 0005h
CLC4SEL3_LC4D4S5_SIZE                    equ 0001h
CLC4SEL3_LC4D4S5_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S5_MASK                    equ 0020h
CLC4SEL3_LC4D4S_POSN                     equ 0000h
CLC4SEL3_LC4D4S_POSITION                 equ 0000h
CLC4SEL3_LC4D4S_SIZE                     equ 0008h
CLC4SEL3_LC4D4S_LENGTH                   equ 0008h
CLC4SEL3_LC4D4S_MASK                     equ 00FFh
CLC4SEL3_D4S_POSN                        equ 0000h
CLC4SEL3_D4S_POSITION                    equ 0000h
CLC4SEL3_D4S_SIZE                        equ 0008h
CLC4SEL3_D4S_LENGTH                      equ 0008h
CLC4SEL3_D4S_MASK                        equ 00FFh
CLC4SEL3_D4S0_POSN                       equ 0000h
CLC4SEL3_D4S0_POSITION                   equ 0000h
CLC4SEL3_D4S0_SIZE                       equ 0001h
CLC4SEL3_D4S0_LENGTH                     equ 0001h
CLC4SEL3_D4S0_MASK                       equ 0001h
CLC4SEL3_D4S1_POSN                       equ 0001h
CLC4SEL3_D4S1_POSITION                   equ 0001h
CLC4SEL3_D4S1_SIZE                       equ 0001h
CLC4SEL3_D4S1_LENGTH                     equ 0001h
CLC4SEL3_D4S1_MASK                       equ 0002h
CLC4SEL3_D4S2_POSN                       equ 0002h
CLC4SEL3_D4S2_POSITION                   equ 0002h
CLC4SEL3_D4S2_SIZE                       equ 0001h
CLC4SEL3_D4S2_LENGTH                     equ 0001h
CLC4SEL3_D4S2_MASK                       equ 0004h
CLC4SEL3_D4S3_POSN                       equ 0003h
CLC4SEL3_D4S3_POSITION                   equ 0003h
CLC4SEL3_D4S3_SIZE                       equ 0001h
CLC4SEL3_D4S3_LENGTH                     equ 0001h
CLC4SEL3_D4S3_MASK                       equ 0008h
CLC4SEL3_D4S4_POSN                       equ 0004h
CLC4SEL3_D4S4_POSITION                   equ 0004h
CLC4SEL3_D4S4_SIZE                       equ 0001h
CLC4SEL3_D4S4_LENGTH                     equ 0001h
CLC4SEL3_D4S4_MASK                       equ 0010h
CLC4SEL3_D4S5_POSN                       equ 0005h
CLC4SEL3_D4S5_POSITION                   equ 0005h
CLC4SEL3_D4S5_SIZE                       equ 0001h
CLC4SEL3_D4S5_LENGTH                     equ 0001h
CLC4SEL3_D4S5_MASK                       equ 0020h

