GopalSaraf/Practicals/PSDL/include/proc/pic16lf18425.inc
#define RA1PPS2                          BANKMASK(RA1PPS), 2
#define RA1PPS3                          BANKMASK(RA1PPS), 3
#define RA1PPS4                          BANKMASK(RA1PPS), 4
#define RA1PPS5                          BANKMASK(RA1PPS), 5
#define RA2                              BANKMASK(PORTA), 2
#define RA2PPS0                          BANKMASK(RA2PPS), 0
#define RA2PPS1                          BANKMASK(RA2PPS), 1
#define RA2PPS2                          BANKMASK(RA2PPS), 2
#define RA2PPS3                          BANKMASK(RA2PPS), 3
#define RA2PPS4                          BANKMASK(RA2PPS), 4
#define RA2PPS5                          BANKMASK(RA2PPS), 5
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA4PPS0                          BANKMASK(RA4PPS), 0
#define RA4PPS1                          BANKMASK(RA4PPS), 1
#define RA4PPS2                          BANKMASK(RA4PPS), 2
#define RA4PPS3                          BANKMASK(RA4PPS), 3
#define RA4PPS4                          BANKMASK(RA4PPS), 4
#define RA4PPS5                          BANKMASK(RA4PPS), 5
#define RA5                              BANKMASK(PORTA), 5
#define RA5PPS0                          BANKMASK(RA5PPS), 0
#define RA5PPS1                          BANKMASK(RA5PPS), 1
#define RA5PPS2                          BANKMASK(RA5PPS), 2
#define RA5PPS3                          BANKMASK(RA5PPS), 3
#define RA5PPS4                          BANKMASK(RA5PPS), 4
#define RA5PPS5                          BANKMASK(RA5PPS), 5
#define RC0                              BANKMASK(PORTC), 0
#define RC0PPS0                          BANKMASK(RC0PPS), 0
#define RC0PPS1                          BANKMASK(RC0PPS), 1
#define RC0PPS2                          BANKMASK(RC0PPS), 2
#define RC0PPS3                          BANKMASK(RC0PPS), 3
#define RC0PPS4                          BANKMASK(RC0PPS), 4
#define RC0PPS5                          BANKMASK(RC0PPS), 5
#define RC1                              BANKMASK(PORTC), 1
#define RC1IE                            BANKMASK(PIE3), 5
#define RC1IF                            BANKMASK(PIR3), 5
#define RC1PPS0                          BANKMASK(RC1PPS), 0
#define RC1PPS1                          BANKMASK(RC1PPS), 1
#define RC1PPS2                          BANKMASK(RC1PPS), 2
#define RC1PPS3                          BANKMASK(RC1PPS), 3
#define RC1PPS4                          BANKMASK(RC1PPS), 4
#define RC1PPS5                          BANKMASK(RC1PPS), 5
#define RC2                              BANKMASK(PORTC), 2
#define RC2PPS0                          BANKMASK(RC2PPS), 0
#define RC2PPS1                          BANKMASK(RC2PPS), 1
#define RC2PPS2                          BANKMASK(RC2PPS), 2
#define RC2PPS3                          BANKMASK(RC2PPS), 3
#define RC2PPS4                          BANKMASK(RC2PPS), 4
#define RC2PPS5                          BANKMASK(RC2PPS), 5
#define RC3                              BANKMASK(PORTC), 3
#define RC3PPS0                          BANKMASK(RC3PPS), 0
#define RC3PPS1                          BANKMASK(RC3PPS), 1
#define RC3PPS2                          BANKMASK(RC3PPS), 2
#define RC3PPS3                          BANKMASK(RC3PPS), 3
#define RC3PPS4                          BANKMASK(RC3PPS), 4
#define RC3PPS5                          BANKMASK(RC3PPS), 5
#define RC4                              BANKMASK(PORTC), 4
#define RC4PPS0                          BANKMASK(RC4PPS), 0
#define RC4PPS1                          BANKMASK(RC4PPS), 1
#define RC4PPS2                          BANKMASK(RC4PPS), 2
#define RC4PPS3                          BANKMASK(RC4PPS), 3
#define RC4PPS4                          BANKMASK(RC4PPS), 4
#define RC4PPS5                          BANKMASK(RC4PPS), 5
#define RC5                              BANKMASK(PORTC), 5
#define RC5PPS0                          BANKMASK(RC5PPS), 0
#define RC5PPS1                          BANKMASK(RC5PPS), 1
#define RC5PPS2                          BANKMASK(RC5PPS), 2
#define RC5PPS3                          BANKMASK(RC5PPS), 3
#define RC5PPS4                          BANKMASK(RC5PPS), 4
#define RC5PPS5                          BANKMASK(RC5PPS), 5
#define RCEN1                            BANKMASK(SSP1CON2), 3
#define RCEN2                            BANKMASK(SSP2CON2), 3
#define RCIDL                            BANKMASK(BAUD1CON), 6
#define RD                               BANKMASK(NVMCON1), 0
#define RD161                            BANKMASK(T1CON), 1
#define RD163                            BANKMASK(T3CON), 1
#define RD165                            BANKMASK(T5CON), 1
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2
#define REPEAT                           BANKMASK(SMT1CON1), 6
#define RES0                             BANKMASK(ADRESL), 0
#define RES1                             BANKMASK(ADRESL), 1
#define RES10                            BANKMASK(ADRESH), 2
#define RES11                            BANKMASK(ADRESH), 3
#define RES12                            BANKMASK(ADRESH), 4
#define RES13                            BANKMASK(ADRESH), 5
#define RES14                            BANKMASK(ADRESH), 6
#define RES15                            BANKMASK(ADRESH), 7
#define RES2                             BANKMASK(ADRESL), 2
#define RES3                             BANKMASK(ADRESL), 3
#define RES4                             BANKMASK(ADRESL), 4
#define RES5                             BANKMASK(ADRESL), 5
#define RES6                             BANKMASK(ADRESL), 6
#define RES7                             BANKMASK(ADRESL), 7
#define RES8                             BANKMASK(ADRESH), 0
#define RES9                             BANKMASK(ADRESH), 1
#define ROI                              BANKMASK(CPUDOZE), 5
#define RPT0                             BANKMASK(ADRPT), 0
#define RPT1                             BANKMASK(ADRPT), 1
#define RPT2                             BANKMASK(ADRPT), 2
#define RPT3                             BANKMASK(ADRPT), 3
#define RPT4                             BANKMASK(ADRPT), 4
#define RPT5                             BANKMASK(ADRPT), 5
#define RPT6                             BANKMASK(ADRPT), 6
#define RPT7                             BANKMASK(ADRPT), 7
#define RSEN1                            BANKMASK(SSP1CON2), 1
#define RSEN2                            BANKMASK(SSP2CON2), 1
#define RST                              BANKMASK(SMT1STAT), 5
#define RW1                              BANKMASK(SSP1STAT), 2
#define RW2                              BANKMASK(SSP2STAT), 2
#define RX1PPS0                          BANKMASK(RX1PPS), 0
#define RX1PPS1                          BANKMASK(RX1PPS), 1
#define RX1PPS2                          BANKMASK(RX1PPS), 2
#define RX1PPS3                          BANKMASK(RX1PPS), 3
#define RX1PPS4                          BANKMASK(RX1PPS), 4
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define R_W1                             BANKMASK(SSP1STAT), 2
#define R_W2                             BANKMASK(SSP2STAT), 2
#define R_nW1                            BANKMASK(SSP1STAT), 2
#define R_nW2                            BANKMASK(SSP2STAT), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SEN2                             BANKMASK(SSP2CON2), 0
#define SENDB                            BANKMASK(TX1STA), 3
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SMP1                             BANKMASK(SSP1STAT), 7
#define SMP2                             BANKMASK(SSP2STAT), 7
#define SMT1AS                           BANKMASK(SMT1STAT), 0
#define SMT1CPOL                         BANKMASK(SMT1CON0), 2
#define SMT1CPR0                         BANKMASK(SMT1CPRL), 0
#define SMT1CPR1                         BANKMASK(SMT1CPRL), 1
#define SMT1CPR10                        BANKMASK(SMT1CPRH), 2
#define SMT1CPR11                        BANKMASK(SMT1CPRH), 3
#define SMT1CPR12                        BANKMASK(SMT1CPRH), 4
#define SMT1CPR13                        BANKMASK(SMT1CPRH), 5
#define SMT1CPR14                        BANKMASK(SMT1CPRH), 6
#define SMT1CPR15                        BANKMASK(SMT1CPRH), 7
#define SMT1CPR16                        BANKMASK(SMT1CPRU), 0
#define SMT1CPR17                        BANKMASK(SMT1CPRU), 1
#define SMT1CPR18                        BANKMASK(SMT1CPRU), 2
#define SMT1CPR19                        BANKMASK(SMT1CPRU), 3
#define SMT1CPR2                         BANKMASK(SMT1CPRL), 2
#define SMT1CPR20                        BANKMASK(SMT1CPRU), 4
#define SMT1CPR21                        BANKMASK(SMT1CPRU), 5
#define SMT1CPR22                        BANKMASK(SMT1CPRU), 6
#define SMT1CPR23                        BANKMASK(SMT1CPRU), 7
#define SMT1CPR3                         BANKMASK(SMT1CPRL), 3
#define SMT1CPR4                         BANKMASK(SMT1CPRL), 4
#define SMT1CPR5                         BANKMASK(SMT1CPRL), 5
#define SMT1CPR6                         BANKMASK(SMT1CPRL), 6
#define SMT1CPR7                         BANKMASK(SMT1CPRL), 7
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2
#define SMT1EN                           BANKMASK(SMT1CON0), 7
#define SMT1GO                           BANKMASK(SMT1CON1), 7
#define SMT1IE                           BANKMASK(PIE8), 0
#define SMT1IF                           BANKMASK(PIR8), 0
#define SMT1MD                           BANKMASK(PMD7), 5
#define SMT1PR0                          BANKMASK(SMT1PRL), 0
#define SMT1PR1                          BANKMASK(SMT1PRL), 1
#define SMT1PR10                         BANKMASK(SMT1PRH), 2
#define SMT1PR11                         BANKMASK(SMT1PRH), 3
#define SMT1PR12                         BANKMASK(SMT1PRH), 4
#define SMT1PR13                         BANKMASK(SMT1PRH), 5
#define SMT1PR14                         BANKMASK(SMT1PRH), 6
#define SMT1PR15                         BANKMASK(SMT1PRH), 7
#define SMT1PR16                         BANKMASK(SMT1PRU), 0
#define SMT1PR17                         BANKMASK(SMT1PRU), 1
#define SMT1PR18                         BANKMASK(SMT1PRU), 2
#define SMT1PR19                         BANKMASK(SMT1PRU), 3
#define SMT1PR2                          BANKMASK(SMT1PRL), 2
#define SMT1PR20                         BANKMASK(SMT1PRU), 4
#define SMT1PR21                         BANKMASK(SMT1PRU), 5
#define SMT1PR22                         BANKMASK(SMT1PRU), 6
#define SMT1PR23                         BANKMASK(SMT1PRU), 7
#define SMT1PR3                          BANKMASK(SMT1PRL), 3
#define SMT1PR4                          BANKMASK(SMT1PRL), 4
#define SMT1PR5                          BANKMASK(SMT1PRL), 5
#define SMT1PR6                          BANKMASK(SMT1PRL), 6
#define SMT1PR7                          BANKMASK(SMT1PRL), 7
#define SMT1PR8                          BANKMASK(SMT1PRH), 0
#define SMT1PR9                          BANKMASK(SMT1PRH), 1
#define SMT1PRAIE                        BANKMASK(PIE8), 1
#define SMT1PRAIF                        BANKMASK(PIR8), 1
#define SMT1PS0                          BANKMASK(SMT1CON0), 0
#define SMT1PS1                          BANKMASK(SMT1CON0), 1
#define SMT1PWAIE                        BANKMASK(PIE8), 2
#define SMT1PWAIF                        BANKMASK(PIR8), 2
#define SMT1REPEAT                       BANKMASK(SMT1CON1), 6
#define SMT1RESET                        BANKMASK(SMT1STAT), 5
#define SMT1RST                          BANKMASK(SMT1STAT), 5
#define SMT1SIGPPS0                      BANKMASK(SMT1SIGPPS), 0
#define SMT1SIGPPS1                      BANKMASK(SMT1SIGPPS), 1
#define SMT1SIGPPS2                      BANKMASK(SMT1SIGPPS), 2
#define SMT1SIGPPS3                      BANKMASK(SMT1SIGPPS), 3
#define SMT1SIGPPS4                      BANKMASK(SMT1SIGPPS), 4
#define SMT1SPOL                         BANKMASK(SMT1CON0), 3
#define SMT1SSEL0                        BANKMASK(SMT1SIG), 0
#define SMT1SSEL1                        BANKMASK(SMT1SIG), 1
#define SMT1SSEL2                        BANKMASK(SMT1SIG), 2
#define SMT1SSEL3                        BANKMASK(SMT1SIG), 3
#define SMT1SSEL4                        BANKMASK(SMT1SIG), 4
#define SMT1STP                          BANKMASK(SMT1CON0), 5
#define SMT1TMR0                         BANKMASK(SMT1TMRL), 0
#define SMT1TMR1                         BANKMASK(SMT1TMRL), 1
#define SMT1TMR10                        BANKMASK(SMT1TMRH), 2
#define SMT1TMR11                        BANKMASK(SMT1TMRH), 3
#define SMT1TMR12                        BANKMASK(SMT1TMRH), 4
#define SMT1TMR13                        BANKMASK(SMT1TMRH), 5
#define SMT1TMR14                        BANKMASK(SMT1TMRH), 6
#define SMT1TMR15                        BANKMASK(SMT1TMRH), 7
#define SMT1TMR16                        BANKMASK(SMT1TMRU), 0
#define SMT1TMR17                        BANKMASK(SMT1TMRU), 1
#define SMT1TMR18                        BANKMASK(SMT1TMRU), 2
#define SMT1TMR19                        BANKMASK(SMT1TMRU), 3
#define SMT1TMR2                         BANKMASK(SMT1TMRL), 2
#define SMT1TMR20                        BANKMASK(SMT1TMRU), 4
#define SMT1TMR21                        BANKMASK(SMT1TMRU), 5
#define SMT1TMR22                        BANKMASK(SMT1TMRU), 6
#define SMT1TMR23                        BANKMASK(SMT1TMRU), 7
#define SMT1TMR3                         BANKMASK(SMT1TMRL), 3
#define SMT1TMR4                         BANKMASK(SMT1TMRL), 4
#define SMT1TMR5                         BANKMASK(SMT1TMRL), 5
#define SMT1TMR6                         BANKMASK(SMT1TMRL), 6
#define SMT1TMR7                         BANKMASK(SMT1TMRL), 7
#define SMT1TMR8                         BANKMASK(SMT1TMRH), 0
#define SMT1TMR9                         BANKMASK(SMT1TMRH), 1
#define SMT1TS                           BANKMASK(SMT1STAT), 2
#define SMT1WINPPS0                      BANKMASK(SMT1WINPPS), 0
#define SMT1WINPPS1                      BANKMASK(SMT1WINPPS), 1
#define SMT1WINPPS2                      BANKMASK(SMT1WINPPS), 2
#define SMT1WINPPS3                      BANKMASK(SMT1WINPPS), 3
#define SMT1WINPPS4                      BANKMASK(SMT1WINPPS), 4
#define SMT1WOL                          BANKMASK(SMT1CON0), 4
#define SMT1WS                           BANKMASK(SMT1STAT), 1
#define SMT1WSEL0                        BANKMASK(SMT1WIN), 0
#define SMT1WSEL1                        BANKMASK(SMT1WIN), 1
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4
#define SOI                              BANKMASK(ADCON3), 3
#define SOR                              BANKMASK(OSCSTAT), 3
#define SOSCEN                           BANKMASK(OSCEN), 3
#define SOSCPWR                          BANKMASK(OSCCON3), 6
#define SPEN                             BANKMASK(RC1STA), 7
#define SPOL                             BANKMASK(SMT1CON0), 3
#define SREN                             BANKMASK(RC1STA), 5
#define SSEL0                            BANKMASK(SMT1SIG), 0
#define SSEL1                            BANKMASK(SMT1SIG), 1
#define SSEL2                            BANKMASK(SMT1SIG), 2
#define SSEL3                            BANKMASK(SMT1SIG), 3
#define SSEL4                            BANKMASK(SMT1SIG), 4
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4
#define SSP1IE                           BANKMASK(PIE3), 0
#define SSP1IF                           BANKMASK(PIR3), 0
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4
#define SSP2CLKPPS0                      BANKMASK(SSP2CLKPPS), 0
#define SSP2CLKPPS1                      BANKMASK(SSP2CLKPPS), 1
#define SSP2CLKPPS2                      BANKMASK(SSP2CLKPPS), 2
#define SSP2CLKPPS3                      BANKMASK(SSP2CLKPPS), 3
#define SSP2CLKPPS4                      BANKMASK(SSP2CLKPPS), 4
#define SSP2DATPPS0                      BANKMASK(SSP2DATPPS), 0
#define SSP2DATPPS1                      BANKMASK(SSP2DATPPS), 1
#define SSP2DATPPS2                      BANKMASK(SSP2DATPPS), 2
#define SSP2DATPPS3                      BANKMASK(SSP2DATPPS), 3
#define SSP2DATPPS4                      BANKMASK(SSP2DATPPS), 4
#define SSP2IE                           BANKMASK(PIE3), 2
#define SSP2IF                           BANKMASK(PIR3), 2
#define SSP2SSPPS0                       BANKMASK(SSP2SSPPS), 0
#define SSP2SSPPS1                       BANKMASK(SSP2SSPPS), 1
#define SSP2SSPPS2                       BANKMASK(SSP2SSPPS), 2
#define SSP2SSPPS3                       BANKMASK(SSP2SSPPS), 3
#define SSP2SSPPS4                       BANKMASK(SSP2SSPPS), 4
#define SSPEN1                           BANKMASK(SSP1CON1), 5
#define SSPEN2                           BANKMASK(SSP2CON1), 5
#define SSPM01                           BANKMASK(SSP1CON1), 0
#define SSPM02                           BANKMASK(SSP2CON1), 0
#define SSPM11                           BANKMASK(SSP1CON1), 1
#define SSPM12                           BANKMASK(SSP2CON1), 1
#define SSPM21                           BANKMASK(SSP1CON1), 2
#define SSPM22                           BANKMASK(SSP2CON1), 2
#define SSPM31                           BANKMASK(SSP1CON1), 3
#define SSPM32                           BANKMASK(SSP2CON1), 3
#define SSPOV1                           BANKMASK(SSP1CON1), 6
#define SSPOV2                           BANKMASK(SSP2CON1), 6
#define START1                           BANKMASK(SSP1STAT), 3
#define START2                           BANKMASK(SSP2STAT), 3
#define STAT0                            BANKMASK(ADSTAT), 0
#define STAT1                            BANKMASK(ADSTAT), 1
#define STAT2                            BANKMASK(ADSTAT), 2
#define STATE                            BANKMASK(WDTTMR), 2
#define STKOVF                           BANKMASK(PCON0), 7
#define STKPTR0                          BANKMASK(STKPTR), 0
#define STKPTR1                          BANKMASK(STKPTR), 1
#define STKPTR2                          BANKMASK(STKPTR), 2
#define STKPTR3                          BANKMASK(STKPTR), 3
#define STKPTR4                          BANKMASK(STKPTR), 4
#define STKUNF                           BANKMASK(PCON0), 6
#define STOP1                            BANKMASK(SSP1STAT), 4
#define STOP2                            BANKMASK(SSP2STAT), 4
#define STP                              BANKMASK(SMT1CON0), 5
#define STPT0                            BANKMASK(ADSTPTL), 0
#define STPT1                            BANKMASK(ADSTPTL), 1
#define STPT10                           BANKMASK(ADSTPTH), 2
#define STPT11                           BANKMASK(ADSTPTH), 3
#define STPT12                           BANKMASK(ADSTPTH), 4
#define STPT13                           BANKMASK(ADSTPTH), 5
#define STPT15                           BANKMASK(ADSTPTH), 6
#define STPT16                           BANKMASK(ADSTPTH), 7
#define STPT2                            BANKMASK(ADSTPTL), 2
#define STPT3                            BANKMASK(ADSTPTL), 3
#define STPT4                            BANKMASK(ADSTPTL), 4
#define STPT5                            BANKMASK(ADSTPTL), 5
#define STPT6                            BANKMASK(ADSTPTL), 6
#define STPT7                            BANKMASK(ADSTPTL), 7
#define STPT8                            BANKMASK(ADSTPTH), 0
#define STPT9                            BANKMASK(ADSTPTH), 1
#define SWDTEN                           BANKMASK(WDTCON0), 0
#define SYSCMD                           BANKMASK(PMD0), 7
#define T016BIT                          BANKMASK(T0CON0), 4
#define T0ASYNC                          BANKMASK(T0CON1), 4
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4
#define T0CKPS0                          BANKMASK(T0CON1), 0
#define T0CKPS1                          BANKMASK(T0CON1), 1
#define T0CKPS2                          BANKMASK(T0CON1), 2
#define T0CKPS3                          BANKMASK(T0CON1), 3
#define T0CS0                            BANKMASK(T0CON1), 5
#define T0CS1                            BANKMASK(T0CON1), 6
